In [1]:
!pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/ad/1e/96282ff3db30befbbf8012ea69ecb0adc5e1064ef38e912bb8a3e4cfbccf/pandas-1.0.3-cp37-cp37m-macosx_10_9_x86_64.whl (10.0MB)
    100% |████████████████████████████████| 10.0MB 1.8MB/s ta 0:00:01   47% |███████████████▎                | 4.8MB 1.0MB/s eta 0:00:06
Collecting numpy>=1.13.3 (from pandas)
  Downloading https://files.pythonhosted.org/packages/a0/3b/9e23c7e8a313a7e03e960d9cd1542cadb7c8633a2eb42b48a8731e387a42/numpy-1.18.3-cp37-cp37m-macosx_10_9_x86_64.whl (15.1MB)
    100% |████████████████████████████████| 15.1MB 1.0MB/s ta 0:00:01
Collecting pytz>=2017.2 (from pandas)
  Downloading https://files.pythonhosted.org/packages/4f/a4/879454d49688e2fad93e59d7d4efda580b783c745fd2ec2a3adf87b0808d/pytz-2020.1-py2.py3-none-any.whl (510kB)
    100% |████████████████████████████████| 512kB 2.1MB/s ta 0:00:01
Requirement already satisfied: python-dateutil>=2.6.1 in ./venv/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)
Installing collected packages: numpy, pytz, pandas
Successfully installed numpy-1.18.3 pandas-1.0.3 pytz-2020.1

In [2]:
import pandas as pd

In [25]:
df = pd.DataFrame(columns=['Name', 'Age'])
df

Empty DataFrame
Columns: [Name, Age]
Index: []

In [26]:
df.loc[0] = ['Allen', '22']
df

    Name Age
0  Allen  22

In [27]:
df.loc[1] = ['Ted', '25']
df.loc[2] = ['Jack', '28']
df

    Name Age
0  Allen  22
1    Ted  25
2   Jack  28

In [28]:
df.loc[4] = ['Tom', '28']
df

    Name Age
0  Allen  22
1    Ted  25
2   Jack  28
4    Tom  28

In [29]:
df['Height'] = ['175', '180', '170', '173']
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170
4    Tom  28    173

In [30]:
df.drop(['Height'], axis=1)

    Name Age
0  Allen  22
1    Ted  25
2   Jack  28
4    Tom  28

In [31]:
df

    Name Age Height
0  Allen  22    175
1    Ted  25    180
2   Jack  28    170
4    Tom  28    173

In [32]:
df = df.drop(['Height'], axis=1)
df

    Name Age
0  Allen  22
1    Ted  25
2   Jack  28
4    Tom  28

In [33]:
df.drop(4)

    Name Age
0  Allen  22
1    Ted  25
2   Jack  28

In [34]:
df

    Name Age
0  Allen  22
1    Ted  25
2   Jack  28
4    Tom  28

In [35]:
df = df.drop(4)

In [36]:
df

    Name Age
0  Allen  22
1    Ted  25
2   Jack  28

In [37]:
df['Age'][0]

'22'

In [38]:
df['Age'][0] = '18'
df

    Name Age
0  Allen  18
1    Ted  25
2   Jack  28

In [39]:
df.loc[0] = '123'
df

   Name  Age
0   123  123
1   Ted   25
2  Jack   28

In [40]:
df.to_csv('./test.csv')

In [41]:
df.to_csv('./test.csv', index=False)

In [42]:
columns = ['Name', 'Age']
row1 = ['Allen', '22']
row2 = ['Ted', '25']
data = [row1, row2]

df = pd.DataFrame(data=data, columns=columns)
df

    Name Age
0  Allen  22
1    Ted  25